app/controllers/users_controller.rb

INSERT INTO "users" ("name", "address", "username", "email", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
def create
  @user= User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Tyler Soo"], ["address", "1234567"], ["updated_at", "2018-11-16 14:53:50.313759"], ["id", 1]]
---
def update
  @user = User.find(params[:id])
  @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "ddwyer"], ["LIMIT", 1]]
---
def find_user
  @user = User.find_by(username: params[:username])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def email

  @user = User.find(params[:id])