app/controllers/userjoblists_controller.rb

INSERT INTO "userjoblists" ("user_id", "job_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["job_id", 10], ["created_at", "2018-11-13 18:16:34.604025"], ["updated_at", "2018-11-13 18:16:34.604025"]]
---
  def create
    @userjoblist = Userjoblist.create(list_params)

SELECT  "userjoblists".* FROM "userjoblists" WHERE "userjoblists"."user_id" = ? AND "userjoblists"."job_id" = ? LIMIT ?  [["user_id", 40], ["job_id", 1], ["LIMIT", 1]]
DELETE FROM "userjoblists" WHERE "userjoblists"."id" = ?  [["id", 30]]
---
  def destroy
    @userjoblist = Userjoblist.find_by(user_id: params[:user_id], job_id: params[:job_id]);
    @userjoblist.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def check
    @exists = "false"
    @jobApiId = params[:job_apiId]
    @userId = params[:user_id]
    @user = User.find(@userId)
    @user.jobs.each do |job|